# Пользователь вводит предложение, заменить все пробелы на "-" 2-мя способами
# 1
new_text = input('Enter text: ')
new_text = new_text.replace(' ','-')
print(new_text)

# 2
new_text = input('Enter text: ')

print(new_text)